results/springboot/r6g.xlarge/wrk5.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: r6g.xlarge
Spring Boot Host: springboot-server-r6g-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-r6g-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.00ms    1.20ms  46.47ms   94.27%
    Req/Sec    13.09k   738.29    15.12k    72.83%
  Latency Distribution
     50%    1.83ms
     75%    2.06ms
     90%    2.71ms
     99%    6.48ms
  1562945 requests in 1.00m, 208.96MB read
Requests/sec:  26048.30
Transfer/sec:      3.48MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-r6g-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.49ms    1.23ms  40.75ms   79.81%
    Req/Sec    14.48k     0.89k   16.94k    68.67%
  Latency Distribution
     50%    3.38ms
     75%    3.91ms
     90%    4.87ms
     99%    6.92ms
  1728699 requests in 1.00m, 231.12MB read
Requests/sec:  28786.77
Transfer/sec:      3.85MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-r6g-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.47ms    2.27ms  85.46ms   80.56%
    Req/Sec    15.61k     1.05k   17.92k    68.12%
  Latency Distribution
     50%    6.24ms
     75%    7.36ms
     90%    8.77ms
     99%   12.61ms
  925616 requests in 30.02s, 123.75MB read
Requests/sec:  30833.61
Transfer/sec:      4.12MB

===== Spring Boot Benchmark Complete =====